src/InformationRegisters/НастройкаНумерацииНалоговыхДокументов/НастройкаНумерацииНалоговыхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаНумерацииНалоговыхДокументов</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВестиМесячнуюНумерациюНалоговыхДокументов</name>
    <comment>Возможность вести нумерацию Налоговых накладных и Приложений 2 с № 1 каждый месяц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиНумерациюНалоговыхДокументовБезУчетаОбособленныхПодразделений</name>
    <comment>Возможность вести нумерацию налоговых документов без учета обособленных подразделений, в случае, когда обособленные подразделения указаны в документах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиРаздельнуюНумерациюНалоговыхДокументовПоНеНДСОперациям</name>
    <comment>Технологические налоговые документы &quot;Не НДС&quot; не будут занимать номера обычных налоговых</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВестиДневнуюНумерациюНалоговыхДокументов</name>
    <comment>Возможность вести нумерацию Налоговых накладных и Приложений 2 с № 1 каждый день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкаНумерацииНалоговыхДокументов/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ВестиМесячнуюНумерациюНалоговыхДокументовПриИзменении(Элемент)
	
	Если Запись.ВестиМесячнуюНумерациюНалоговыхДокументов Тогда
		Запись.ВестиДневнуюНумерациюНалоговыхДокументов = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВестиДневнуюНумерациюНалоговыхДокументовПриИзменении(Элемент)
	
	Если Запись.ВестиДневнуюНумерациюНалоговыхДокументов Тогда
		// остальные виды нумерации отключаем за ненадобностью
		Запись.ВестиМесячнуюНумерациюНалоговыхДокументов 					= Ложь;
		Запись.ВестиРаздельнуюНумерациюНалоговыхДокументовПоНеНДСОперациям = Ложь;
		Запись.ВестиНумерациюНалоговыхДокументовБезУчетаОбособленныхПодразделений = Ложь;		
	КонецЕсли;

КонецПроцедуры
